app/views/users/index.html.erb

              <%= link_to user do %>
                <h2 class='list'><%= user.profile.first_name %> - <%= user.profile.last_name %></h2>
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]