app/views/users/show.html.erb

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
---
    <div class='col-md-3 text-center'>
      <% if @user.profile.present? %>