app/views/pages/home.html.erb

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? LIMIT ?  [["user_id", 3], ["LIMIT", 1]]
---
        <div class='well'>
          <% if current_user.profile.present? %>