app/controllers/pages_controller.rb

SELECT  "plans".* FROM "plans" WHERE "plans"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def home
    @basic_plan = Plan.find(1)